fintest_240_60/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1.5 0 0);

boundaryField
{
    inletlow
    {
        type            turbulentInlet;
        referenceField  uniform (1 0 0);
        fluctuationScale (0 -0.1 0);
        value           uniform (1 0 0);
    }
	
    inletup
    {
        type            turbulentInlet;
        referenceField  uniform (2 0 0);
        fluctuationScale (0 0.2 0);
        value           uniform (2 0 0);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    top
    {
        type            slip;
    }


    bottom
    {
        type            slip;
    }

    frontAndBack
    {
        type            empty;
    }


}

// ************************************************************************* //
