fintest_240_60/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)   // 0
    (8 0 0)   // 1
    (8 2 0)   // 2
    (0 2 0)   // 3

    (0 0 0.5)   // 4
    (8 0 0.5)   // 5
    (8 2 0.5)   // 6
    (0 2 0.5)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (240 60 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
);

mergePatchPairs
(
);
